validation/moldCHT-fill/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Two-region fill mesh: a 60 x 2 mm cavity channel (region cavity) with
    a 60 x 5 mm mould block above it (region mold). The shared face at
    y = 2 mm becomes the conjugate interface after splitMeshRegions;
    the left cavity face is the inlet and the right face is the vent.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0    0     0)       // 0
    (0.06 0     0)       // 1
    (0.06 0.002 0)       // 2
    (0    0.002 0)       // 3
    (0    0     0.002)   // 4
    (0.06 0     0.002)   // 5
    (0.06 0.002 0.002)   // 6
    (0    0.002 0.002)   // 7
    (0    0.007 0)       // 8
    (0.06 0.007 0)       // 9
    (0    0.007 0.002)   // 10
    (0.06 0.007 0.002)   // 11
);

blocks
(
    hex (0 1 2 3 4 5 6 7)     (240  8 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10)   (240 10 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }

    vent
    {
        type patch;
        faces ((1 2 6 5));
    }

    cavityBottom
    {
        type wall;
        faces ((0 1 5 4));
    }

    moldSides
    {
        type wall;
        faces
        (
            (3 8 10 7)
            (2 9 11 6)
        );
    }

    moldTop
    {
        type wall;
        faces ((8 9 11 10));
    }
);

// ************************************************************************* //
